{
  "users": [
    {
      "id": 1,
      "username": "Yaya",
      "email": "cardkeisha@gmail.com",
      "password": "1111"
    },
    {
      "id": 2,
      "username": "lbradwell1",
      "email": "djohansen1@eepurl.com",
      "password": "mhUUgClUg"
    },
    {
      "id": 3,
      "username": "adhooghe2",
      "email": "mdelbergue2@spotify.com",
      "password": "idntpv5"
    },
    {
      "id": 4,
      "username": "wsawfoot3",
      "email": "lhumblestone3@nydailynews.com",
      "password": "d1Np1t9"
    },
    {
      "id": 5,
      "username": "proseveare4",
      "email": "jfolke4@rambler.ru",
      "password": "fLPg9617ec"
    },
    {
      "id": 6,
      "username": "cfigiovanni5",
      "email": "chandscombe5@unblog.fr",
      "password": "3zCCH0"
    },
    {
      "id": 7,
      "username": "mfontes6",
      "email": "rshelborne6@reddit.com",
      "password": "NpwFxZh5Kva"
    },
    {
      "username": "Seth Dana",
      "email": "seth.dana@gmail.com",
      "password": "password",
      "id": 11
    },
    {
      "username": "Friendo",
      "email": "friends@friend.com",
      "password": "friendo",
      "id": 13
    },
    {
      "username": "Sunny",
      "email": "sunny@friend.com",
      "password": "1111",
      "id": 14
    }
  ],
  "gardens": [
    {
      "id": 1,
      "title": "Salsa Dance",
      "synopsis": "Grow everything you need to make delicious pico de gallo, salsa verde, or salsa rojo from scratch! A variety of peppers means you can tailor your salsas to your perfect level of spiciness.",
      "gardenTypeId": 1
    },
    {
      "id": 2,
      "title": "Bartender's Buddy",
      "synopsis": "You too can become a fancy mixologist! Create classic cocktails like mojitos, basil smashes, and sangrias with ingredients you grow.",
      "gardenTypeId": 2
    },
    {
      "id": 3,
      "title": "Feed Your Friends",
      "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
      "gardenTypeId": 3
    },
    {
      "id": 4,
      "title": "Not Your Grandma's Tea Garden",
      "synopsis": "Get zen and brew tasty teas with these aromatic and beautiful herbs, flowers, and fruits.",
      "gardenTypeId": 4
    },
    {
      "id": 5,
      "title": "Olive Garden Garden",
      "synopsis": "Perfect your own signature pizza sauce or heap classic Italian home-grown herbs on fresh fococcia bread and make all your friends a delicious meal showcasing your garden.",
      "gardenTypeId": 5
    },
    {
      "id": 6,
      "title": "Build Your Own",
      "synopsis": "You're a rebel! Use our plant database and grow tips to design your dream garden.",
      "gardenTypeId": 6
    }
  ],
  "gardenType": [
    {
      "id": 1,
      "type": "salsa dance"
    },
    {
      "id": 2,
      "type": "bartender's buddy"
    },
    {
      "id": 3,
      "type": "Feed your friends"
    },
    {
      "id": 4,
      "type": "Not Your Grandmother's Tea Garden"
    },
    {
      "id": 5,
      "type": "Olive Garden Garden"
    },
    {
      "id": 6,
      "type": "Build Your Own"
    }
  ],
  "plants": [
    {
      "id": 1,
      "plantName": "Fresh Salsa Tomato",
      "hardinessZone": "Hardiness Zone: 5-11",
      "growTips": "This tomato's large, meaty, plum-shaped fruit stays firm when chopped, is easy to deseed and won't water down your salsa.",
      "picture": "/img/fresh-salsa.jpg"
    },
    {
      "id": 2,
      "plantName": "Tomatillo",
      "hardinessZone": "Hardiness Zone: 5-11",
      "growTips": "Tomatillos are easy to grow, but make sure to plant at least three because they do not self-pollinate. Tomatillos thrive in the same conditions as tomatoes. Don't remove the papery tunic that grows over the fruit until ready to use the tomatillo.",
      "picture": "/img/tomatillo.jpg"
    },
    {
      "id": 3,
      "plantName": "Jalapeno",
      "hardinessZone": "Hardiness Zone: 3-11",
      "growTips": "These medium-spicy peppers are very easy to grow. They need lots of sun and regular watering -- but try not to get the peppers themselves wet. Harvest peppers when they are still green for best texture and flavor.",
      "picture": "/img/jalapeno.jpg"
    },
    {
      "id": 4,
      "plantName": "Serrano",
      "hardinessZone": "Hardiness Zone: 5-11",
      "growTips": "Harvest hot serrano peppers when they are still green or when they are mature and will be red or yellow. Wear gloves when handling spicy peppers.",
      "picture": "/img/serrano.jpg"
    },
    {
      "id": 5,
      "plantName": "Lime Tree",
      "hardinessZone": "Hardiness Zone: 8-11",
      "growTips": "Lime trees usually need 3-4 years to begin to bear fruit and need a little extra work to grow well. They require lots of fertilizing. Make sure not to overwater, as lime trees are prone to root rot.",
      "picture": "/img/lime-tree.jpg"
    },
    {
      "id": 6,
      "plantName": "Onions",
      "hardinessZone": "Hardiness Zone: 3-9",
      "growTips": "Do NOT plant onions with or near tomatoes or potatoes! Plant in the spring for a fall harvest, and fertilize frequently for larger bulbs. For sweeter onions, water more often.",
      "picture": "/img/onions.jpg"
    },
    {
      "id": 7,
      "plantName": "Garlic",
      "hardinessZone": "Hardiness Zone: 3-9",
      "growTips": "In mild climates, plant your garlic in fall and harvest in late spring, when most of the leaves dry out and turn brown. Resist the urge to pull them out by the stems! Always dig up gently with a hand spade.",
      "picture": "/img/garlic.jpg"
    },
    {
      "id": 8,
      "plantName": "Brandywine Tomato",
      "hardinessZone": "Hardiness Zone: 5-10",
      "growTips": "This no-fuss tomato grows large, flavorful fruit. Use a simple tomato cage to support branches from breaking due to heavy fruit, and keep the fruit from resting on the ground or they will rot.",
      "picture": "/img/brandywine-toms.jpg"
    },
    {
      "id": 9,
      "plantName": "Anaheim Pepper",
      "hardinessZone": "Hardiness Zone: 5-11",
      "growTips": "This sweet and mild spicy pepper plant doesn't require too much watering and is easy to grow if provided lots of bright sunlight.",
      "picture": "/img/anaheim-pepper.jpg"
    },
    {
      "id": 10,
      "plantName": "Cumin",
      "hardinessZone": "Hardiness Zone: 5-10",
      "growTips": "Cumin has lovely groups of white flowers. Leave the flowers to go to seed and dry on the stem. Toast and grind the seeds to make this delicious spice from scratch.",
      "picture": "/img/cumin_plant.jpg"
    },
    {
      "id": 11,
      "plantName": "Oregano",
      "hardinessZone": "Hardiness Zone: 5-10",
      "growTips": "Oregano grows beautifully in pots as well as in garden beds. To keep your oregano happy, let the soil dry out between waterings.",
      "picture": "/img/use-oregano.jpg"
    },
    {
      "id": 12,
      "plantName": "Cilantro",
      "hardinessZone": "Hardiness Zone: 3-11",
      "growTips": "Cilantro's bright, fresh leaves are a staple in salsas. Snip the flowers off as they form to keep your cilantro growing continuously through the season. Cilantro benefits from partial shade as temperatures rise in the summer.",
      "picture": "/img/cilantro.jpg"
    },
    {
      "id": 13,
      "plantName": "Hops",
      "hardinessZone": "Hardiness Zone: 3-8",
      "growTips": "Hops grow beautiful vines that can be used to canopy an area or grown along a trellis for a bold statement. Produces aromatic compound lantern-like flowers that are often used to brew beer.",
      "picture": "/img/hops%20(2).jpg"
    },
    {
      "id": 14,
      "plantName": "Basil",
      "hardinessZone": "Hardiness Zone: 5-10",
      "growTips": "Basil is a beginner garden's best friend! Basil can easily take over an entire garden. Snip off flowers to ensure a continuous supply of tasty leaves all season. Use fresh to add to drinks, salads, or as a garnish, or dry for sauces and soups.",
      "picture": "URL"
    },
    {
      "id": 15,
      "plantName": "Mint",
      "hardinessZone": "Hardiness Zone: 3-11",
      "growTips": "Mint can take over a garden quickly, so plant it by itself or in a container to keep it from becoming too invasive. Mint is tasty fresh or dried in cocktails or teas.",
      "picture": "/img/use-this-mint.jpg"
    },
    {
      "id": 16,
      "plantName": "Violets (viola genus)",
      "hardinessZone": "Hardiness Zone: 5-10",
      "growTips": "Tiny violet flowers are lovely floated on drinks or sugared and added to cakes or cookies. They only bloom in early spring, but you'll see their heart shaped leaves through summer - be careful not to mistake them for weeds and pull them!",
      "picture": "/img/use-this-violets.jpg"
    },
    {
      "id": 17,
      "plantName": "Lavender",
      "hardinessZone": "Hardiness Zone: 5-9",
      "growTips": "Lavender is very difficult to start from seed - spring for a young plant! Lavender must be in well draining soil, it does not tolerate soggy ground. Once it's established, lavender is remarkably hardy and will last several years.",
      "picture": "/img/use-this-lavender.jpg"
    },
    {
      "id": 18,
      "plantName": "Rose",
      "hardinessZone": "Hardiness Zone: 3-11",
      "growTips": "Not all roses are created equal! Visit a garden shop to find a rose that fits your gardening skill and hardiness zone. Some varieties thrive on neglect. Rose petals and rose hips are aromatic in teas and other foods.",
      "picture": "/img/use-roses.jpg"
    },
    {
      "id": 19,
      "plantName": "Peach Tree",
      "hardinessZone": "Hardiness Zone: 5-8",
      "growTips": "Choose a tree that is about 1 year old and plant it in the spring, preferably the day it is purchased. Prune annually to maintain fruit production and prevent disease. Fresh peaches are wonderful in sangrias and dried peaches add sweetness and flavor to teas.",
      "picture": "/img/peach.jpg"
    },
    {
      "id": 20,
      "plantName": "Strawberry",
      "hardinessZone": "Hardiness Zone: 3-10",
      "growTips": "Strawberries are relatively easy berries to grow but you may be fighting wild bunnies for the fruit! Don't spash on the berries during watering to keep them from becoming diseased. Dried strawberries are wonderful in teas and snacks.",
      "picture": "/img/strawberries.jpg"
    },
    {
      "id": 21,
      "plantName": "Blueberry",
      "hardinessZone": "Hardiness Zone: 3-9",
      "growTips": "Blueberries are one of the easiest fruit to grow! While they are self-pollinating, planting two or more will ensure a heavier fruit set. These naturally disease- and pest-resistant plants can last for decades.",
      "picture": "/img/blueberry-bush.jpg"
    },
    {
      "id": 22,
      "plantName": "Orange Tree",
      "hardinessZone": "Hardiness Zone: 8-11",
      "growTips": "Citrus fruit takes around 6-8 months to ripen, and will not ripen if picked early, so leave them on the tree until they are ready. The best way to determine ripeness is by picking a fruit and tasting it.",
      "picture": "/img/orangetree.jpg"
    },
    {
      "id": 23,
      "plantName": "Apple Tree",
      "hardinessZone": "Hardiness Zone: 3-8",
      "growTips": "Apple trees are realtively easy to grow and care for. Apples are delicious fresh, frozen, or dired for use in teas or as a snack. Don't plant near cedar trees or your fruit will become too diseased to salvage. Prune mature trees annually during winter.",
      "picture": "/img/apple-tree.jpg"
    },
    {
      "id": 24,
      "plantName": "Bee Balm",
      "hardinessZone": "Hardiness Zone: 3-9",
      "growTips": "Also known as bergamot, you must be patient if growing from seed as it will take at least a full year to bloom. For quicker access to these showy blooms beloved by people and pollinators alike, opt to buy a young plant. Bee Balm is very hardy once established and can last several years.",
      "picture": "/img/bee-balm.jpg"
    },
    {
      "id": 25,
      "plantName": "Sunflower",
      "hardinessZone": "Hardiness Zone: 2-11",
      "growTips": "Sunflower can easily and reliably be grown from seed for even ovice gardeners -- just sow them directly into your garden bed. Let the flowers dry on the stalk and watch as birds flock to your garden to feed on the dried seeds.",
      "picture": "/img/sunflower.jpg"
    },
    {
      "id": 26,
      "plantName": "Mulberry Tree",
      "hardinessZone": "Hardiness Zone: 5-9",
      "growTips": "Mulberry trees are small-medium sized trees that grow quickly and will produce delicious mulberries within the first year or two of planting. These trees provide shelter for birds as well as tasty berries for wildlife & and humans. Plant out of the way of walkways and driveways as the berries squish and stain when they fall.",
      "picture": "/img/mulberry.jpg"
    },
    {
      "id": 27,
      "plantName": "Blackberry",
      "hardinessZone": "Hardiness Zone: 5-10",
      "growTips": "Blackberries are excellent for new gardeners as they grow easily and voraciously. Berries have many culinary uses and also help feed wildlife, while the plant provides shelter to birds and rabbits too. Thornless varieties make harvesting berries even easier.",
      "picture": "/img/blackberry.jpg"
    },
    {
      "id": 28,
      "plantName": "Yarrow",
      "hardinessZone": "Hardiness Zone: 3-9",
      "growTips": "Native to North America, this hardy, sweet smelling plant does well in poor soils, is drought resistant, and attracts butterflies & bees",
      "picture": "/img/use-yarrow.jpg"
    },
    {
      "id": 29,
      "plantName": "Borage",
      "hardinessZone": "Hardiness Zone: 4-11",
      "growTips": "Easily grown from seed, this plant is a beneficial companion plant in gardens, and the star-shaped flowers add bright color and a light cucumber flavor to salads. Attracts pollinators.",
      "picture": "/img/borage.jpg"
    },
    {
      "id": 30,
      "plantName": "Kale",
      "hardinessZone": "Hardiness Zone: 3-10",
      "growTips": "Easily grown from seed, kale is a tasty snack for wild bunnies as well as humans. Once the plant has reached mature size, it is drought resistant and will grow more leaves as they are clipped for salads.",
      "picture": "/img/kale.jpg"
    },
    {
      "id": 31,
      "plantName": "Trumpet Vine",
      "hardinessZone": "Hardiness Zone: 4-9",
      "growTips": "Widely considered to be a native plant, trumpet vine grows easily and is a beautiful climber on trellises and walls. Nectar-rich, they will attract many birds and pollinators.",
      "picture": "/img/trumpet vine.jpg"
    },
    {
      "id": 32,
      "plantName": "Purple Coneflower",
      "hardinessZone": "Hardiness Zone: 3-9",
      "growTips": "Also known as echinacea, this plant takes at least a year to bloom from seed -- spring for a young plant to get your flowers sooner! Attracts butterflies, bees, and other pollinators.",
      "picture": "/img/purple-coneflower.jpg"
    },
    {
      "id": 33,
      "plantName": "Milkweed",
      "hardinessZone": "Hardiness Zone: 3-9",
      "growTips": "Once established, this plant is very hardy and will last for several years. Make sure to purchase a milkweed indigenous to your location to maximize ecological benefits, like helping maintain butterfly populations.",
      "picture": "/img/milkweed.jpg"
    },
    {
      "id": 34,
      "plantName": "Elderberry",
      "hardinessZone": "Hardiness Zone: 3-9",
      "growTips": "Elderberry grows wild all over the United States but is widely available for purchase at garden centers if you don't fancy digging one up. It boasts lovely full white flowers that mature into tasty dark shiney berries. Elderberry will attract many pollinators, feed birds in the fall, and can be used to make delicious teas and wine.",
      "picture": "/img/elderberry.jpg"
    },
    {
      "id": 35,
      "plantName": "Oak Tree",
      "hardinessZone": "Hardiness Zone: 3-10",
      "growTips": "Oak trees grow very large -- over 60 feet at maturity and are a cinch to care for, needing very little attention. Advanced gardeners may have fun propogating oak trees from acorns, but trees are readily availble at garden centers. Oak trees are important to wildlife and will keep the squirrels, birds, and other creatures very happy in your area.",
      "picture": "/img/red-oak.jpg"
    },
    {
      "id": 36,
      "plantName": "Dogwood Tree",
      "hardinessZone": "Hardiness Zone: 3-9",
      "growTips": "These small-medium flowering trees make a lovely addition to any garden. Their flowers are among the first in spring, and the bright red berries in fall help feed wildlife. They thrive in well-drained soil in partial shade.",
      "picture": "URL"
    },
    {
      "id": 37,
      "plantName": "Lemon Balm",
      "hardinessZone": "Hardiness Zone: 4-9",
      "growTips": "Lemon balm is easy to grow and will thrive in a shady, cooler part of the garden. Fragrant leaves can be pinched off all season and are a nice addition to teas and recipes that would benefit from a lemony touch.",
      "picture": "/img/lemonbalm-flowering.jpg"
    },
    {
      "id": 38,
      "plantName": "Chamomile",
      "hardinessZone": "Hardiness Zone: 4-9",
      "growTips": "These fragrant flowers look delicate but are tough! Chamomile is a classic tea ingredient, grows well even in poor soil, and does not require much watering or care once mature.",
      "picture": "/img/chamomile.jpg"
    },
    {
      "id": 39,
      "plantName": "Passionflower",
      "hardinessZone": "Hardiness Zone: 5-11",
      "growTips": "These exotic-looking flowering vines can grow almost anywhere and need very little care. The flowers can be used in teas and attract pollinators.",
      "picture": "/img/passionfruit.jpg"
    },
    {
      "id": 40,
      "plantName": "Hibiscus",
      "hardinessZone": "Hardiness Zone: 4-11",
      "growTips": "There are many types of hibiscus -- choose a varietal ideal for your area and level of expertise. These plants produce large, colorful flowers that can be used in flavored simple syrups and teas. They require some extra care, like fertilization and pruning.",
      "picture": "/img/hibiscus.jpg"
    },
    {
      "id": 41,
      "plantName": "Pear Tree",
      "hardinessZone": "Hardiness Zone: 3-10",
      "growTips": "Pear trees are easy to grow and naturally disease- and pest-resistant. Plant at least two pear trees for pollination, and plant them in late winter or early spring.",
      "picture": "/img/pears.jpg"
    },
    {
      "id": 42,
      "plantName": "Currants",
      "hardinessZone": "Hardiness Zone: 3-8",
      "growTips": "These tart berries make wonderful jellies and teas and grow just fine in the shade. Do not prune until the plant is fully mature, about three years.",
      "picture": "/img/currants.jpg"
    },
    {
      "id": 43,
      "plantName": "Parsley",
      "hardinessZone": "Hardiness Zone: 4-9",
      "growTips": "This super easy-to-grow herb is wonderful in many dishes and wild bunnies love to munch on it, too.",
      "picture": "URL"
    },
    {
      "id": 44,
      "plantName": "Rosemary",
      "hardinessZone": "Hardiness Zone: 6-9",
      "growTips": "Give your rosemary plenty of room to grow -- they grow to about 4 feet high and wide! This aromatic, hardy plant can last for years.",
      "picture": "/img/rosemary.jpg"
    },
    {
      "id": 45,
      "plantName": "Thyme",
      "hardinessZone": "Hardiness Zone: 5-9",
      "growTips": "There are over 50 variaties of thyme, with different flavors and aromas, from English thyme to lemon thyme to carraway thyme. These plants are excellent for beginner gardeners. Let thyme dry out between waterings for the most success.",
      "picture": "/img/use-thyme.jpg"
    },
    {
      "id": 46,
      "plantName": "Fennel",
      "hardinessZone": "Hardiness Zone: 2-10",
      "growTips": "Some varieties of fennel grow wild in the western US, will naturalize easily in the garden, and will self sow year after year. Most of this plant is edible and tasty, from the seeds to the tiny yellow flowers to tender stalks to the white bulbs.",
      "picture": "/img/fennel.jpg"
    },
    {
      "id": 47,
      "plantName": "San Marzano Tomato",
      "hardinessZone": "Hardiness Zone: 5-10",
      "growTips": "San Marzanos are Italy's most famous tomatoes, known for making sauces and pastes due to their meaty structure, peelable skins, and easy-to-scoop out compact seed pockets. The shape makes them perfect for canning.",
      "picture": "/img/sanmarzanos.jpg"
    },
    {
      "id": 48,
      "plantName": "Olive Tree",
      "hardinessZone": "Hardiness Zone: 8-11",
      "growTips": "Although these trees need bright, hot sun and well-draining soil, they still need to be watered regularly. They can live to be hundreds of years old, and may be grown in very large pots as well as in the ground.",
      "picture": "/img/use-this-olive.jpg"
    },
    {
      "id": 49,
      "plantName": "Sage",
      "hardinessZone": "Hardiness Zone: 5-9",
      "growTips": "This hardy, delectable herb is also gorgeous! Sage comes in many colors and flowers can be anywhere from white to purple. Sage is most flavorful fresh, but can be easily dried or frozen.",
      "picture": "/img/sage.jpg"
    },
    {
      "id": 50,
      "plantName": "Pimiento Pepper",
      "hardinessZone": "Hardiness Zone: 6-10",
      "growTips": "Pimiento peppers are sweet but flavorful and grow well in containers. The plants produce large bounties of heart shaped peppers that turn red when mature and are excellent for canning.",
      "picture": "/img/pimiento-pepper.jpg"
    },
    {
      "id": 51,
      "plantName": "Pepperoncini",
      "hardinessZone": "Hardiness Zone: 7-10",
      "growTips": "The sandier your soil, the better your pepperoncini will thrive! Water them regularly for sweeter peppers, and water less for spicier ones. These are classic pickled peppers to serve with Italian-style sammies or a couple slices of pizza.",
      "picture": "/img/pepperoncini.jpg"
    },
    {
      "id": 52,
      "plantName": "Jimmy Nardello Pepper",
      "hardinessZone": "Hardiness Zone: 6-10",
      "growTips": "This sweet red pepper plant was famously brought to the US by an Italian family over 100 years ago. These easy-to-grow peppers are usually among the first peppers to ripen in a garden and are delicious raw, cooked, or dried.",
      "picture": "/img/jimmy-nardello.jpg"
    }
  ],
  "gardenPlants": [
    {
      "id": 1,
      "gardenId": 1,
      "plantId": 1
    },
    {
      "id": 2,
      "gardenId": 1,
      "plantId": 2
    },
    {
      "id": 3,
      "gardenId": 1,
      "plantId": 3
    },
    {
      "id": 4,
      "gardenId": 1,
      "plantId": 4
    },
    {
      "id": 5,
      "gardenId": 1,
      "plantId": 5
    },
    {
      "id": 6,
      "gardenId": 1,
      "plantId": 6
    },
    {
      "id": 7,
      "gardenId": 1,
      "plantId": 7
    },
    {
      "id": 8,
      "gardenId": 1,
      "plantId": 8
    },
    {
      "id": 9,
      "gardenId": 1,
      "plantId": 9
    },
    {
      "id": 10,
      "gardenId": 1,
      "plantId": 10
    },
    {
      "id": 11,
      "gardenId": 1,
      "plantId": 11
    },
    {
      "id": 12,
      "gardenId": 1,
      "plantId": 12
    },
    {
      "id": 13,
      "gardenId": 2,
      "plantId": 13
    },
    {
      "id": 14,
      "gardenId": 2,
      "plantId": 14
    },
    {
      "id": 15,
      "gardenId": 2,
      "plantId": 15
    },
    {
      "id": 16,
      "gardenId": 2,
      "plantId": 5
    },
    {
      "id": 17,
      "gardenId": 2,
      "plantId": 17
    },
    {
      "id": 18,
      "gardenId": 2,
      "plantId": 18
    },
    {
      "id": 19,
      "gardenId": 2,
      "plantId": 19
    },
    {
      "id": 20,
      "gardenId": 2,
      "plantId": 20
    },
    {
      "id": 21,
      "gardenId": 2,
      "plantId": 21
    },
    {
      "id": 22,
      "gardenId": 2,
      "plantId": 22
    },
    {
      "id": 23,
      "gardenId": 2,
      "plantId": 23
    },
    {
      "id": 24,
      "gardenId": 3,
      "plantId": 24
    },
    {
      "id": 25,
      "gardenId": 3,
      "plantId": 25
    },
    {
      "id": 26,
      "gardenId": 3,
      "plantId": 26
    },
    {
      "id": 27,
      "gardenId": 3,
      "plantId": 27
    },
    {
      "id": 28,
      "gardenId": 3,
      "plantId": 28
    },
    {
      "id": 29,
      "gardenId": 3,
      "plantId": 29
    },
    {
      "id": 30,
      "gardenId": 3,
      "plantId": 30
    },
    {
      "id": 31,
      "gardenId": 3,
      "plantId": 31
    },
    {
      "id": 32,
      "gardenId": 3,
      "plantId": 32
    },
    {
      "id": 33,
      "gardenId": 3,
      "plantId": 33
    },
    {
      "id": 34,
      "gardenId": 3,
      "plantId": 34
    },
    {
      "id": 35,
      "gardenId": 3,
      "plantId": 35
    },
    {
      "id": 36,
      "gardenId": 3,
      "plantId": 36
    },
    {
      "id": 32,
      "gardenId": 4,
      "plantId": 15
    },
    {
      "id": 37,
      "gardenId": 4,
      "plantId": 37
    },
    {
      "id": 38,
      "gardenId": 4,
      "plantId": 38
    },
    {
      "id": 39,
      "gardenId": 4,
      "plantId": 24
    },
    {
      "id": 40,
      "gardenId": 4,
      "plantId": 18
    },
    {
      "id": 41,
      "gardenId": 4,
      "plantId": 39
    },
    {
      "id": 42,
      "gardenId": 4,
      "plantId": 17
    },
    {
      "id": 43,
      "gardenId": 4,
      "plantId": 40
    },
    {
      "id": 44,
      "gardenId": 4,
      "plantId": 19
    },
    {
      "id": 45,
      "gardenId": 4,
      "plantId": 23
    },
    {
      "id": 46,
      "gardenId": 4,
      "plantId": 41
    },
    {
      "id": 47,
      "gardenId": 4,
      "plantId": 20
    },
    {
      "id": 48,
      "gardenId": 4,
      "plantId": 42
    },
    {
      "id": 49,
      "gardenId": 4,
      "plantId": 34
    },
    {
      "id": 50,
      "gardenId": 5,
      "plantId": 14
    },
    {
      "id": 51,
      "gardenId": 5,
      "plantId": 11
    },
    {
      "id": 52,
      "gardenId": 5,
      "plantId": 43
    },
    {
      "id": 53,
      "gardenId": 5,
      "plantId": 44
    },
    {
      "id": 54,
      "gardenId": 5,
      "plantId": 45
    },
    {
      "id": 55,
      "gardenId": 5,
      "plantId": 46
    },
    {
      "id": 56,
      "gardenId": 5,
      "plantId": 47
    },
    {
      "id": 57,
      "gardenId": 5,
      "plantId": 7
    },
    {
      "id": 58,
      "gardenId": 5,
      "plantId": 6
    },
    {
      "id": 59,
      "gardenId": 5,
      "plantId": 48
    },
    {
      "id": 60,
      "gardenId": 5,
      "plantId": 49
    },
    {
      "id": 61,
      "gardenId": 5,
      "plantId": 50
    },
    {
      "id": 62,
      "gardenId": 5,
      "plantId": 51
    },
    {
      "id": 63,
      "gardenId": 5,
      "plantId": 52
    }
  ],
  "gardenTypeRating": [
    {
      "id": "",
      "gardenTypeId": "",
      "rating": ""
    }
  ],
  "friends": [],
  "userGardens": [
    {
      "userId": 1,
      "garden": {
        "title": "Feed Your Friends",
        "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
        "plants": [
          {
            "id": 27,
            "gardenId": 3,
            "plantId": 27,
            "plant": {
              "id": 27,
              "plantName": "Blackberry",
              "hardinessZone": "Hardiness Zone: 5-10",
              "growTips": "Blackberries are excellent for new gardeners as they grow easily and voraciously. Berries have many culinary uses and also help feed wildlife, while the plant provides shelter to birds and rabbits too. Thornless varieties make harvesting berries even easier.",
              "picture": "/img/blackberry.jpg"
            },
            "garden": {
              "id": 3,
              "title": "Feed Your Friends",
              "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
              "gardenTypeId": 3
            }
          },
          {
            "id": 28,
            "gardenId": 3,
            "plantId": 28,
            "plant": {
              "id": 28,
              "plantName": "Yarrow",
              "hardinessZone": "Hardiness Zone: 3-9",
              "growTips": "Native to North America, this hardy, sweet smelling plant does well in poor soils, is drought resistant, and attracts butterflies & bees",
              "picture": "/img/use-yarrow.jpg"
            },
            "garden": {
              "id": 3,
              "title": "Feed Your Friends",
              "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
              "gardenTypeId": 3
            }
          },
          {
            "id": 29,
            "gardenId": 3,
            "plantId": 29,
            "plant": {
              "id": 29,
              "plantName": "Borage",
              "hardinessZone": "Hardiness Zone: 4-11",
              "growTips": "Easily grown from seed, this plant is a beneficial companion plant in gardens, and the star-shaped flowers add bright color and a light cucumber flavor to salads. Attracts pollinators.",
              "picture": "/img/borage.jpg"
            },
            "garden": {
              "id": 3,
              "title": "Feed Your Friends",
              "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
              "gardenTypeId": 3
            }
          },
          {
            "id": 30,
            "gardenId": 3,
            "plantId": 30,
            "plant": {
              "id": 30,
              "plantName": "Kale",
              "hardinessZone": "Hardiness Zone: 3-10",
              "growTips": "Easily grown from seed, kale is a tasty snack for wild bunnies as well as humans. Once the plant has reached mature size, it is drought resistant and will grow more leaves as they are clipped for salads.",
              "picture": "/img/kale.jpg"
            },
            "garden": {
              "id": 3,
              "title": "Feed Your Friends",
              "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
              "gardenTypeId": 3
            }
          },
          {
            "id": 31,
            "gardenId": 3,
            "plantId": 31,
            "plant": {
              "id": 31,
              "plantName": "Trumpet Vine",
              "hardinessZone": "Hardiness Zone: 4-9",
              "growTips": "Widely considered to be a native plant, trumpet vine grows easily and is a beautiful climber on trellises and walls. Nectar-rich, they will attract many birds and pollinators.",
              "picture": "/img/trumpet vine.jpg"
            },
            "garden": {
              "id": 3,
              "title": "Feed Your Friends",
              "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
              "gardenTypeId": 3
            }
          },
          {
            "id": 32,
            "gardenId": 3,
            "plantId": 32,
            "plant": {
              "id": 32,
              "plantName": "Purple Coneflower",
              "hardinessZone": "Hardiness Zone: 3-9",
              "growTips": "Also known as echinacea, this plant takes at least a year to bloom from seed -- spring for a young plant to get your flowers sooner! Attracts butterflies, bees, and other pollinators.",
              "picture": "/img/purple-coneflower.jpg"
            },
            "garden": {
              "id": 3,
              "title": "Feed Your Friends",
              "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
              "gardenTypeId": 3
            }
          },
          {
            "id": 33,
            "gardenId": 3,
            "plantId": 33,
            "plant": {
              "id": 33,
              "plantName": "Milkweed",
              "hardinessZone": "Hardiness Zone: 3-9",
              "growTips": "Once established, this plant is very hardy and will last for several years. Make sure to purchase a milkweed indigenous to your location to maximize ecological benefits, like helping maintain butterfly populations.",
              "picture": "/img/milkweed.jpg"
            },
            "garden": {
              "id": 3,
              "title": "Feed Your Friends",
              "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
              "gardenTypeId": 3
            }
          },
          {
            "id": 34,
            "gardenId": 3,
            "plantId": 34,
            "plant": {
              "id": 34,
              "plantName": "Elderberry",
              "hardinessZone": "Hardiness Zone: 3-9",
              "growTips": "Elderberry grows wild all over the United States but is widely available for purchase at garden centers if you don't fancy digging one up. It boasts lovely full white flowers that mature into tasty dark shiney berries. Elderberry will attract many pollinators, feed birds in the fall, and can be used to make delicious teas and wine.",
              "picture": "/img/elderberry.jpg"
            },
            "garden": {
              "id": 3,
              "title": "Feed Your Friends",
              "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
              "gardenTypeId": 3
            }
          },
          {
            "id": 35,
            "gardenId": 3,
            "plantId": 35,
            "plant": {
              "id": 35,
              "plantName": "Oak Tree",
              "hardinessZone": "Hardiness Zone: 3-10",
              "growTips": "Oak trees grow very large -- over 60 feet at maturity and are a cinch to care for, needing very little attention. Advanced gardeners may have fun propogating oak trees from acorns, but trees are readily availble at garden centers. Oak trees are important to wildlife and will keep the squirrels, birds, and other creatures very happy in your area.",
              "picture": "/img/red-oak.jpg"
            },
            "garden": {
              "id": 3,
              "title": "Feed Your Friends",
              "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
              "gardenTypeId": 3
            }
          },
          {
            "id": 36,
            "gardenId": 3,
            "plantId": 36,
            "plant": {
              "id": 36,
              "plantName": "Dogwood Tree",
              "hardinessZone": "Hardiness Zone: 3-9",
              "growTips": "These small-medium flowering trees make a lovely addition to any garden. Their flowers are among the first in spring, and the bright red berries in fall help feed wildlife. They thrive in well-drained soil in partial shade.",
              "picture": "URL"
            },
            "garden": {
              "id": 3,
              "title": "Feed Your Friends",
              "synopsis": "Your garden can be a haven for wildlife -- attract birds, wild bunnies, and pollinators like bees and butterflies.",
              "gardenTypeId": 3
            }
          }
        ]
      },
      "id": 1
    }
  ]
}